TF plan for `dev.shared`:

```
Terraform will perform the following actions:

  # aws_s3_bucket_lifecycle_configuration.trail must be replaced
-/+ resource "aws_s3_bucket_lifecycle_configuration" "trail" {
      ~ bucket                                 = "edu-ucsc-gi-platform-hca-dev-logs.us-east-1" -> "edu-ucsc-gi-platform-hca-dev-trail.us-east-1" # forces replacement
      ~ id                                     = "edu-ucsc-gi-platform-hca-dev-logs.us-east-1" -> (known after apply)
      ~ transition_default_minimum_object_size = "all_storage_classes_128K" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ rule {
            id     = "expire"
            # (2 unchanged attributes hidden)

          ~ expiration {
              ~ expired_object_delete_marker = false -> (known after apply)
                # (2 unchanged attributes hidden)
            }

            # (1 unchanged block hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
```